const reg = {
  tel: /^[1][3,4,5,6,7,8,9][0-9]{9}$/, // 验证手机号
  switchText: /(\d{3})\d{4}(\d{4})/, // 转换为*
  userpwd: /^(?=.{8,})(((?=.*[A-Z])(?=.*[a-z0-9\W_]))|((?=.*[a-z])(?=.*[0-9\W_]))|((?=.*[0-9])(?=.*[\W_]))).*$/,
  newPwd: /^(?=.*[A-Za-z])(?=.*\d)(?=.*[`~!@#$%^&*()_+<>?:"{},.\/\\;'[\]])[A-Za-z\d`~!@#$%^&*()_+<>?:"{},.\/\\;'[\]]{8,}$/,// 8位及以上，同时包含字母、数字及特殊字符
  mail: /[a-zA-Z0-9]{1,10}@[a-zA-Z0-9]{1,}\.[a-zA-Z0-9]{1,}/, // 判断是否为邮箱
  iccid: /^[a-zA-Z0-9]{20}$/, // iccid,联通sim
  // ydSim: /^[0-9]{11}$/, // 移动sim
  ydSim: /^([0-9]{11}|[0-9]{13})$/, // 移动sim
  // barcode: /^(A027E00428)[a-zA-Z0-9]{20}/, // 终端条形码
  barcode: /^(A027E00428)([a-zA-Z0-9]{20}|[a-zA-Z0-9]{19})$/, // 终端条形码
  terminalcode: /^[1-9]\d{7}$/, // 终端编号
  vinno: /^[A-Za-z0-9]{17}$/, // vinno
  caralias: /^[A-Za-z0-9]{18}$/, // 整车物料
  fuelCarAlias:/^[A-Za-z0-9]{6}[BCEUMP]{1}[A-Za-z0-9]*$/,// 燃油整车物料
  // newEnergyVehicle: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领]{1}[A-HJ-NP-Z]{1}(([A-Za-z0-9]{6}))$/, // 新能源车
  // newEnergyVehicle: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领]{1}[A-HJ-NP-Z]{1}(([ABCDEFGHJK][A-HJ-NP-Z0-9][0-9]{4}))$/, 
  newEnergyVehicle: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领]{1}[A-Za-z]{1}(([0-9]{5}[AaDdFf])|([AaDdFf][A-Ha-hJ-Nj-nP-Zp-z0-9][0-9]{4}))$/, // 新能源车
  fuelTruck: /^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领]{1}[A-Za-z]{1}[A-aH-hJ-jN-nP-pZ-z0-9]{4}[A-aH-hJ-jN-hP-pZ-z0-9挂学警港澳]{1})$/, // 燃油车
  // plateNumber:/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领]{1}[A-Za-z]{1}(([0-9]{5}[AaDdFf])|([AaZDdFf][A-Ha-hJ-Nj-nP-Zp-z0-9][0-9]{4}))$/,
  digitalpoint: /^\d+(\.\d+)?$/,  // 带小数点的数字
  alphanumeric:/^[A-Za-z0-9]+$/,//数字、字母
  alphanline:/^[0-9a-zA-Z_-]{1,}$/,//数字、字母、_、-
  functionName:/^[A-Za-z0-9\u4e00-\u9fa5]+$/,//支持汉字、大小写字母、数字
  functionNames:/^[A-Za-z0-9-\u4e00-\u9fa5]+$/,//支持汉字、大小写字母、数字、-
  functionNames1:/^[A-Za-z0-9-&\u4e00-\u9fa5 ]+$/,//支持汉字、大小写字母、数字、空格、-、&   加空格的原因：层级路由名字重复，无法选择对应的父级路由
  functionUrl:/^[A-Za-z0-9/]+$/,//支持字母、数字、/
  filePath:/^[A-Za-z0-9/_-]+$/,//支持字母、数字、/、_、-
  chinese:/^[^\u4e00-\u9fa5]+$/ ,//中文
  space:/^[^\s]*$/,//空格
  decimalNumber:/^[1-9]{1}\d{0,}$|^[1-9]{1}\d{0,}\.\d{1,}$|^0\.\d{1,}$|^0$/,//小数和整数
  decimalNumbers:/^([1-9][\d]*|0)(\.[\d]+)?$/,//整数和小数，不包含负数
  number:/^[0-9]*$/,//数字
  idCard:/^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/,//身份证号
  Znumber:/^[1-9]\d*$/,//正整数
  Znumbers:/^([1-9][\d]*|0)$/,//整数
  DNumber:/^[0-9]{1}([0-9]|[.])*$/,//数字和小数点
  capitalNumber:/^[A-Z0-9]*$/,//大写字母和数字
  versionNumber:/^[Vv]([1-9]\d|[1-9])(.([1-9]\d|\d)){2,10}$/,//版本号
}
export default reg
